NoMaY-jp/FreeRTOS_examples_for_Renesas_R_CPUs/30_I2C_Simple_Master_100Kbps_Basic/RL78_RL78G14_FPB_Renesas_e2studio_CS+/src/demo_specific_io.h
/*
 * FreeRTOS V202012.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

#ifndef LED_IO_H
#define LED_IO_H

/* Include the register definition file that is correct for the hardware being
used.  The C and assembler pre-processor must have one of the following board
definitions defined to have the correct register definition header file
included.  Alternatively, just manually include the correct files here. */

	/* Prevent the files being included from the FreeRTOS port layer assembly
	source files. */
	#if !(defined(__GNUC__) && defined(__ASSEMBLER__))

		#if defined(__CCRL__) || defined(__GNUC__)
			#include "iodefine.h"
			#if defined(__GNUC__)
				#include "iodefine_ext.h"
			#endif
		#endif

		#ifdef YRPBRL78G13
			#if  defined(__ICCRL78__) ||  defined(__IASMRL78__)
				#include "ior5f100le.h"
				#include "ior5f100le_ext.h"
			#endif
			#define LED_BIT			( P7_bit.no7 )
			#define LED_INIT()		P7 &= 0x7F; PM7 &= 0x7F
		#endif /* YRPBRL78G13 */

		#ifdef YRDKRL78G14
			#if  defined(__ICCRL78__) ||  defined(__IASMRL78__)
				#include "ior5f104pj.h"
				#include "ior5f104pj_ext.h"
			#endif
			#define LED_BIT			( P4_bit.no1 )
			#define LED_INIT() 		LED_BIT = 0
		#endif /* YRDKRL78G14 */

		#ifdef RSKRL78G1C
			#if  defined(__ICCRL78__) ||  defined(__IASMRL78__)
				#include "ior5f10jgc.h"
				#include "ior5f10jgc_ext.h"
			#endif
			#define LED_BIT			( P0_bit.no1 )
			#define LED_INIT()		P0 &= 0xFD; PM0 &= 0xFD
		#endif /* RSKRL78G1C */

		#ifdef RSKRL78L1C
			#if  defined(__ICCRL78__) ||  defined(__IASMRL78__)
				#include "ior5f110pj.h"
				#include "ior5f110pj_ext.h"
			#endif
			#define LED_BIT			( P4_bit.no1 )
			#define LED_INIT()		P4 &= 0xFD; PM4 &= 0xFD
		#endif /* RSKRL78L1C */

		#ifdef RSKRL78L13
			#if  defined(__ICCRL78__) ||  defined(__IASMRL78__)
				#include "ior5f10wmg.h"
				#include "ior5f10wmg_ext.h"
			#endif
			#define LED_BIT			( P4_bit.no1 )
			#define LED_INIT() 		P4 &= 0xFD; PM4 &= 0xFD
		#endif /* RSKRL78L13 */

		#ifdef RL78_G1A_TB
			#if  defined(__ICCRL78__) ||  defined(__IASMRL78__)
				#include "ior5f10ele.h"
				#include "ior5f10ele_ext.h"
			#endif
			#define LED_BIT			( P6_bit.no2 )
			#define LED_INIT() 		P6 &= 0xFB; PM6 &= 0xFB
		#endif /* RL78_G1A_TB */

		#ifdef RL78_G14_FPB
			#if  defined(__ICCRL78__) ||  defined(__IASMRL78__)
				#include "ior5f104ml.h"
				#include "ior5f104ml_ext.h"
			#endif
			#define LED_BIT			( P4_bit.no3 )
			#define LED_INIT()		P4 &= 0xF7; PM4 &= 0xF7; P4 |= 0x10; PM4 &= 0xEF
		#endif /* RL78_G14_FPB */

		#ifdef AE_R5F100LGAFB
			#if  defined(__ICCRL78__) ||  defined(__IASMRL78__)
				#include "ior5f100lg.h"
				#include "ior5f100lg_ext.h"
			#endif
			/* P5.0 is compatible with LED_BUILTIN of GR-KURUMI and GR-COTTON */
			#define LED_BIT			( P5_bit.no0 )
			#define LED_INIT()		P5 &= 0xFE; PM5 &= 0xFE
		#endif /* AER5F100LGAFB */

		#ifndef LED_BIT
			#error The hardware platform is not defined
		#endif

	#endif /* !(defined(__GNUC__) && defined(__ASSEMBLER__)) */

#endif /* LED_IO_H */

